Revit 2027 API
BuiltInFailures.AutoRouteFailures.FailedDowngradeCrossToTee Property
 Failed to downgrade cross type to tee type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedDowngradeCrossToTee { get; }
Public Shared ReadOnly Property FailedDowngradeCrossToTee As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedDowngradeCrossToTee {
	FailureDefinitionId^ get ();
}
static member FailedDowngradeCrossToTee : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace